; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v1 ?v7)
             (pred_3 ?v10 ?v4)
             (pred_12 ?v1 ?v4)
             (pred_9 ?v12 ?v1 )
	     (pred_8 ?v1)
             (pred_10 ?v6)
             (pred_7 ?v10)
             (pred_2 ?v4)
             (pred_11 ?v1)
             (pred_1 ?v10)
             (pred_5 ?v1)
             (pred_6 ))



(:action op_2
:parameters (?v11 ?v9 ?v8 ?v13)
:precondition (and (pred_10 ?v11) (pred_10 ?v9) (pred_7 ?v8) (pred_2 ?v13)
          (pred_4 ?v11 ?v9) (pred_3 ?v8 ?v13)
                   (pred_12 ?v9 ?v13) (pred_8 ?v11) 
                   (pred_11 ?v9) (pred_1 ?v8))
:effect (and  (pred_5 ?v9) (not (pred_11 ?v9))))


(:action op_3
:parameters (?v11 ?v5)
:precondition (and (pred_10 ?v11) (pred_10 ?v5)
               (pred_8 ?v11) (pred_4 ?v11 ?v5) (pred_5 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v11))))

(:action op_1
:parameters (?v11 ?v8)
:precondition (and (pred_10 ?v11) (pred_7 ?v8) 
                  (pred_8 ?v11) (pred_9 ?v8 ?v11) (pred_6 ))
:effect (and (pred_1 ?v8)
   (not (pred_9 ?v8 ?v11)) (not (pred_6 ))))


(:action op_5
:parameters (?v11 ?v2 ?v3)
:precondition (and (pred_10 ?v11) (pred_7 ?v2) (pred_7 ?v3)
                  (pred_8 ?v11) (pred_1 ?v3) (pred_9 ?v2 ?v11))
:effect (and (pred_1 ?v2) (pred_9 ?v3 ?v11)
        (not (pred_1 ?v3)) (not (pred_9 ?v2 ?v11))))

(:action op_4
:parameters (?v11 ?v8)
:precondition (and (pred_10 ?v11) (pred_7 ?v8) 
                  (pred_8 ?v11) (pred_1 ?v8))
:effect (and (pred_6 ) (pred_9 ?v8 ?v11) (not (pred_1 ?v8)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_19 obj_16 obj_11 obj_07 obj_32 obj_10 obj_13 obj_05 obj_14 obj_09 obj_30 obj_27 obj_29 obj_17 obj_15 obj_12 obj_21 obj_18 obj_26 obj_20 obj_23 obj_22 obj_08 obj_24 obj_04
    obj_31 obj_01 obj_25
    obj_28 obj_02 obj_06 obj_03
    )

    (:init
       (pred_6)

       (pred_10 obj_19)
       (pred_10 obj_16)
       (pred_10 obj_11)
       (pred_10 obj_07)
       (pred_10 obj_32)
       (pred_10 obj_10)
       (pred_10 obj_13)
       (pred_10 obj_05)
       (pred_10 obj_14)
       (pred_10 obj_09)
       (pred_10 obj_30)
       (pred_10 obj_27)
       (pred_10 obj_29)
       (pred_10 obj_17)
       (pred_10 obj_15)
       (pred_10 obj_12)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_26)
       (pred_10 obj_20)
       (pred_10 obj_23)
       (pred_10 obj_22)
       (pred_10 obj_08)
       (pred_10 obj_24)
       (pred_10 obj_04)
       (pred_2 obj_31)
       (pred_2 obj_01)
       (pred_2 obj_25)
       (pred_7 obj_28)
       (pred_7 obj_02)
       (pred_7 obj_06)
       (pred_7 obj_03)

       (pred_4 obj_19 obj_10)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_16 obj_13)
       (pred_4 obj_16 obj_11)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_11 obj_05)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_11 obj_16)
       (pred_4 obj_07 obj_14)
       (pred_4 obj_07 obj_32)
       (pred_4 obj_07 obj_11)
       (pred_4 obj_32 obj_09)
       (pred_4 obj_32 obj_07)
       (pred_4 obj_10 obj_30)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_10 obj_19)
       (pred_4 obj_13 obj_27)
       (pred_4 obj_13 obj_05)
       (pred_4 obj_13 obj_16)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_05 obj_29)
       (pred_4 obj_05 obj_14)
       (pred_4 obj_05 obj_11)
       (pred_4 obj_05 obj_13)
       (pred_4 obj_14 obj_17)
       (pred_4 obj_14 obj_09)
       (pred_4 obj_14 obj_07)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_09 obj_15)
       (pred_4 obj_09 obj_32)
       (pred_4 obj_09 obj_14)
       (pred_4 obj_30 obj_12)
       (pred_4 obj_30 obj_27)
       (pred_4 obj_30 obj_10)
       (pred_4 obj_27 obj_21)
       (pred_4 obj_27 obj_29)
       (pred_4 obj_27 obj_13)
       (pred_4 obj_27 obj_30)
       (pred_4 obj_29 obj_18)
       (pred_4 obj_29 obj_17)
       (pred_4 obj_29 obj_05)
       (pred_4 obj_29 obj_27)
       (pred_4 obj_17 obj_26)
       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_14)
       (pred_4 obj_17 obj_29)
       (pred_4 obj_15 obj_20)
       (pred_4 obj_15 obj_09)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_12 obj_23)
       (pred_4 obj_12 obj_21)
       (pred_4 obj_12 obj_30)
       (pred_4 obj_21 obj_22)
       (pred_4 obj_21 obj_18)
       (pred_4 obj_21 obj_27)
       (pred_4 obj_21 obj_12)
       (pred_4 obj_18 obj_08)
       (pred_4 obj_18 obj_26)
       (pred_4 obj_18 obj_29)
       (pred_4 obj_18 obj_21)
       (pred_4 obj_26 obj_24)
       (pred_4 obj_26 obj_20)
       (pred_4 obj_26 obj_17)
       (pred_4 obj_26 obj_18)
       (pred_4 obj_20 obj_04)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_20 obj_26)
       (pred_4 obj_23 obj_22)
       (pred_4 obj_23 obj_12)
       (pred_4 obj_22 obj_08)
       (pred_4 obj_22 obj_21)
       (pred_4 obj_22 obj_23)
       (pred_4 obj_08 obj_24)
       (pred_4 obj_08 obj_18)
       (pred_4 obj_08 obj_22)
       (pred_4 obj_24 obj_04)
       (pred_4 obj_24 obj_26)
       (pred_4 obj_24 obj_08)
       (pred_4 obj_04 obj_20)
       (pred_4 obj_04 obj_24)
       (pred_11 obj_22)
       (pred_11 obj_29)
       (pred_11 obj_09)
       (pred_11 obj_17)
       (pred_12  obj_22 obj_31)
       (pred_12  obj_29 obj_01)
       (pred_12  obj_09 obj_25)
       (pred_12  obj_17 obj_01)
       (pred_5 obj_19)
       (pred_5 obj_16)
       (pred_5 obj_11)
       (pred_5 obj_07)
       (pred_5 obj_32)
       (pred_5 obj_10)
       (pred_5 obj_13)
       (pred_5 obj_05)
       (pred_5 obj_14)
       (pred_5 obj_30)
       (pred_5 obj_27)
       (pred_5 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_21)
       (pred_5 obj_18)
       (pred_5 obj_26)
       (pred_5 obj_20)
       (pred_5 obj_23)
       (pred_5 obj_08)
       (pred_5 obj_24)
       (pred_5 obj_04)

       (pred_3  obj_28 obj_31)
       (pred_3  obj_02 obj_01)
       (pred_3  obj_06 obj_25)
       (pred_3  obj_03 obj_01)
       (pred_9 obj_28 obj_21)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_03 obj_24)
       (pred_8 obj_16)
    )

    (:goal (and
       (pred_9 obj_28 obj_10)
       (pred_9 obj_06 obj_32)
       (pred_9 obj_03 obj_20)
    ))
(:constraints
  (always (not (pred_8 obj_26)))
)
)

; plan
1. (op_3 obj_16 obj_13)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_13)
   goals met: 0 of 3
2. (op_3 obj_13 obj_27)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_27)
   goals met: 0 of 3
3. (op_3 obj_27 obj_21)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_21)
   goals met: 0 of 3
4. (op_1 obj_21 obj_28)
   deleted: (pred_9 obj_28 obj_21) (pred_6)
   added: (pred_1 obj_28)
   goals met: 0 of 3
5. (op_3 obj_21 obj_27)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_27)
   goals met: 0 of 3
6. (op_3 obj_27 obj_13)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_13)
   goals met: 0 of 3
7. (op_3 obj_13 obj_10)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_10)
   goals met: 0 of 3
8. (op_4 obj_10 obj_28)
   deleted: (pred_1 obj_28)
   added: (pred_6) (pred_9 obj_28 obj_10)
   goals met: 1 of 3
9. (op_3 obj_10 obj_13)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_13)
   goals met: 1 of 3
10. (op_3 obj_13 obj_16)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_16)
   goals met: 1 of 3
11. (op_1 obj_16 obj_06)
   deleted: (pred_9 obj_06 obj_16) (pred_6)
   added: (pred_1 obj_06)
   goals met: 1 of 3
12. (op_3 obj_16 obj_13)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_13)
   goals met: 1 of 3
13. (op_3 obj_13 obj_27)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_27)
   goals met: 1 of 3
14. (op_3 obj_27 obj_21)
   deleted: (pred_8 obj_27)
   added: (pred_8 obj_21)
   goals met: 1 of 3
15. (op_3 obj_21 obj_18)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_18)
   goals met: 1 of 3
16. (op_3 obj_18 obj_08)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_08)
   goals met: 1 of 3
17. (op_3 obj_08 obj_24)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_24)
   goals met: 1 of 3
18. (op_5 obj_24 obj_03 obj_06)
   deleted: (pred_1 obj_06) (pred_9 obj_03 obj_24)
   added: (pred_1 obj_03) (pred_9 obj_06 obj_24)
   goals met: 1 of 3
19. (op_3 obj_24 obj_04)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_04)
   goals met: 1 of 3
20. (op_3 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 1 of 3
21. (op_4 obj_20 obj_03)
   deleted: (pred_1 obj_03)
   added: (pred_6) (pred_9 obj_03 obj_20)
   goals met: 2 of 3
22. (op_3 obj_20 obj_04)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_04)
   goals met: 2 of 3
23. (op_3 obj_04 obj_24)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_24)
   goals met: 2 of 3
24. (op_1 obj_24 obj_06)
   deleted: (pred_9 obj_06 obj_24) (pred_6)
   added: (pred_1 obj_06)
   goals met: 2 of 3
25. (op_3 obj_24 obj_04)
   deleted: (pred_8 obj_24)
   added: (pred_8 obj_04)
   goals met: 2 of 3
26. (op_3 obj_04 obj_20)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_20)
   goals met: 2 of 3
27. (op_3 obj_20 obj_15)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_15)
   goals met: 2 of 3
28. (op_2 obj_15 obj_09 obj_06 obj_25)
   deleted: (pred_11 obj_09)
   added: (pred_5 obj_09)
   goals met: 2 of 3
29. (op_3 obj_15 obj_09)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_09)
   goals met: 2 of 3
30. (op_3 obj_09 obj_32)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_32)
   goals met: 2 of 3
31. (op_4 obj_32 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_6) (pred_9 obj_06 obj_32)
   goals met: 3 of 3
